КАКерамика_моя_старая_база/src/AccumulationRegisters/ПериодыУходаЗаБольнымиРодственниками/ПериодыУходаЗаБольнымиРодственниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПериодыУходаЗаБольнымиРодственниками</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОплаченоДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачалоПериодаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериодаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Родственник</name>
    <type>
      <types>CatalogRef.РодственникиФизическихЛиц</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СлучайУходаЗаБольнымРебенком</name>
    <comment>Идентифицирует код причины нетрудоспособности, возраст ребенка и параметры лечения, влияющие на размер пособия.</comment>
    <type>
      <types>EnumRef.СлучаиУходаЗаБольнымиДетьми</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалаСобытия</name>
    <comment>Дата начала первичного листка нетрудоспособности</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

КАКерамика_моя_старая_база/src/AccumulationRegisters/ПериодыУходаЗаБольнымиРодственниками/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ФизическоеЛицо)";
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбновлениеИнформационнойБазы

Процедура ЗаполнитьДатуНачалаСобытия(ПараметрыОбновления = Неопределено) Экспорт
	ОбработкаЗавершена = Истина;
	
	ОбъектМетаданных = Метаданные.РегистрыНакопления.ПериодыУходаЗаБольнымиРодственниками;
	Блокировка = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ОписаниеБлокируемыхДанных(ОбъектМетаданных);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПериодыУхода.Регистратор КАК Регистратор,
	|	Больничный.ДатаНачалаСобытия КАК ДатаНачалаСобытияВБольничном
	|ИЗ
	|	РегистрНакопления.ПериодыУходаЗаБольнымиРодственниками КАК ПериодыУхода
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.БольничныйЛист КАК Больничный
	|		ПО ПериодыУхода.Регистратор = Больничный.Ссылка
	|			И ПериодыУхода.ДатаНачалаСобытия <> Больничный.ДатаНачалаСобытия
	|
	|СГРУППИРОВАТЬ ПО
	|	Больничный.ДатаНачалаСобытия,
	|	ПериодыУхода.Регистратор";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Блокировка.ПоляБлокировки.Регистратор = Выборка.Регистратор;
		Успех = ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.НачатьОбновлениеДанных(Блокировка, ПараметрыОбновления);
		Если Не Успех Тогда
			ОбработкаЗавершена = Ложь;
			Продолжить;
		КонецЕсли;
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = Выборка.Регистратор;
		НаборЗаписей.ОбменДанными.Загрузка = Истина;
		НаборЗаписей.Прочитать();
		Для Каждого Запись Из НаборЗаписей Цикл
			Запись.ДатаНачалаСобытия = Выборка.ДатаНачалаСобытияВБольничном;
		КонецЦикла;
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей, Истина);
		ОбновлениеИнформационнойБазыЗарплатаКадрыБазовый.ЗавершитьОбновлениеДанных(ПараметрыОбновления);
	КонецЦикла;
	
	Если ПараметрыОбновления <> Неопределено Тогда
		ПараметрыОбновления.ОбработкаЗавершена = ОбработкаЗавершена;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти


#КонецОбласти


#КонецЕсли
